Revit 2027 API
AnnotationLabel.GetParameterFormatting Method
 Gets the collection of parameter formatting objects for the parameters seen in the label.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<AnnotationLabelParameterFormatting> GetParameterFormatting()
Public Function GetParameterFormatting As IList(Of AnnotationLabelParameterFormatting)
public:
IList<AnnotationLabelParameterFormatting^>^ GetParameterFormatting()
member GetParameterFormatting : unit -> IList<AnnotationLabelParameterFormatting>
Return Value
IList<AnnotationLabelParameterFormatting>
 The collection of parameter formatting objects for the parameters seen in the label.
Remarks
 The parameters are returned in the order they are shown in the label.
See Also
Reference
AnnotationLabel Class
Autodesk.Revit.DB Namespace